content/news.org
#+startup: content indent

[[file:index.org][Giovanni's Diary]] >

* What's New
#+INDEX: Giovanni's Diary!What's New

This page contains some of the latest entries in the diary, the first
entry is the most recent. I am currently manually editing this page so I
may forget to add something simetimes, hopefully I will automate this
soon.

If you want to receive automatic updates you can subscribe to the [[file:feeds.org][RSS
feeds]].

** Latest Entries

- [[file:programming/linux/benchmarking-on-linux.org][Programming > Linux > notes > Benchmarking on Linux]]
- [[file:programming/linux/linux-monitoring-with-prometheus-and-grafana.org][Programming > Linux > notes > Monitor your Linux system with Prometheus and Grafana]]
- I changed the landing page, now there is more text spaced more
  densly.
- [[file:programming/free-as-in-freedom.org][programming > Free as in Freedom]]
- [[file:ephemeris/2025-05-20.org][ephemeris > notes > 2025-05-20 - Struggles with NetworkManager]]

-----

Travel: [[file:index.org][Giovanni's Diary]], [[file:theindex.org][Index]] 
