public/news.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="index.html">Giovanni's Diary</a> &gt;
</p>

<div id="outline-container-org8980bca" class="outline-2">
<h2 id="org8980bca">What's New</h2>
<div class="outline-text-2" id="text-org8980bca">
<p>
This page contains some of the latest entries in the diary, the first
entry is the most recent. I am currently manually editing this page so I
may forget to add something simetimes, hopefully I will automate this
soon.
</p>

<p>
If you want to receive automatic updates you can subscribe to the <a href="feeds.html">RSS
feeds</a>.
</p>
</div>

<div id="outline-container-org3a15af1" class="outline-3">
<h3 id="org3a15af1">Latest Entries</h3>
<div class="outline-text-3" id="text-org3a15af1">
<ul class="org-ul">
<li><a href="programming/linux/benchmarking-on-linux.html">Programming &gt; Linux &gt; notes &gt; Benchmarking on Linux</a></li>
<li><a href="programming/linux/linux-monitoring-with-prometheus-and-grafana.html">Programming &gt; Linux &gt; notes &gt; Monitor your Linux system with Prometheus and Grafana</a></li>
<li>I changed the landing page, now there is more text spaced more
densly.</li>
<li><a href="programming/free-as-in-freedom.html">programming &gt; Free as in Freedom</a></li>
<li><a href="ephemeris/2025-05-20.html">ephemeris &gt; notes &gt; 2025-05-20 - Struggles with NetworkManager</a></li>
</ul>

<hr />

<p>
Travel: <a href="index.html">Giovanni's Diary</a>, <a href="theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</div>
</body>
</html>
